Revit 2026 API

# AddInId Methods

---

The AddInId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAddInName | name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns |
|  | GetAddInNameFromDocument | name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns. |
|  | GetGUID | value of the AddInId as a GUID |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

AddInId Class

Autodesk.Revit.DB Namespace